xml.log

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header/>
    
	<soapenv:Body>
		<air:LowFareSearchReq AuthorizedBy="uAPI5393466565-37810389" SolutionResult="false" TargetBranch="P7182092" xmlns:air="http://www.travelport.com/schema/air_v50_0" TraceId="FBUAPI39053" xmlns:common="http://www.travelport.com/schema/common_v50_0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.travelport.com/schema/air_v50_0 file:///C:/Users/mukil.kumar/Documents/Ecommerce/WSDL/Release-V17.3.0.35-V17.3/air_v50_0/AirReqRsp.xsd">
    
			<common:BillingPointOfSaleInfo OriginApplication="uAPI"/>
			
    <air:SearchAirLeg>
				
    <air:SearchOrigin>
					<common:CityOrAirport Code="BOM"/>
				
    </air:SearchOrigin>
				<air:SearchDestination>
					
    <common:CityOrAirport Code="DEL"/>
				
    </air:SearchDestination>
				
    <air:SearchDepTime PreferredTime="2022-12-09"/>
			
    </air:SearchAirLeg>
			<air:SearchAirLeg>
				<air:SearchOrigin>
					
    <common:CityOrAirport Code="DEL"/>
				
    </air:SearchOrigin>
				
    <air:SearchDestination>
					<common:CityOrAirport Code="BOM"/>
    
				</air:SearchDestination>
				
    <air:SearchDepTime PreferredTime="2022-12-12"/>
			
    </air:SearchAirLeg>
			<air:AirSearchModifiers>
				<air:PreferredProviders>
					<common:Provider Code="1G"/>
				 </air:PreferredProviders>
			
    </air:AirSearchModifiers>
			<common:SearchPassenger Code="ADT" BookingTravelerRef="ilay2SzXTkSUYRO+0owUNw==0"/>
			
    
			
    <common:SearchPassenger Code="CNN" Age="10" BookingTravelerRef="IAmvmlf5SO+ZVfy5o8VPuA==0"/>
			<common:SearchPassenger Code="CNN" Age="6" BookingTravelerRef="IAmvmlf5SO+ZVfy5o8VPuA==1"/>
			<common:SearchPassenger Code="INF" Age="1" PricePTCOnly="true" BookingTravelerRef="8hLudMvaTjOj4QViG7Dz2A==0"/>
			
			<air:AirPricingModifiers ETicketability="Yes" FaresIndicator="AllFares" CurrencyType="INR"/>
			<air:FareRulesFilterCategory>
				
    <air:CategoryCode>CHG</air:CategoryCode>
			</air:FareRulesFilterCategory>
		</air:LowFareSearchReq>
	</soapenv:Body>
</soapenv:Envelope> 
